engineer-ae3o/stm32-hal-library/components/test/src/adc.cpp
            uint16_t raw = 0;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_get_oneshot(nullptr, ADC_CHANNEL_0, &raw));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_get_oneshot(ADC1, ADC_CHANNEL_0, nullptr));

            adc_configure_channel(ADC_CHANNEL_0);
            TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_get_oneshot(ADC1, ADC_CHANNEL_0, &raw));
            TEST_ASSERT_TRUE(raw <= 0xFFFU);
            LOGI(TAG, "[oneshot_regular_group_completes_within_12_bit_range] Raw ADC channel 0 sample: %u", raw);
        }

        void internal_channel_readings_complete_and_manage_their_own_enables() {
            reset_to_baseline();

            uint16_t raw = 0;

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_v_bat(nullptr, &raw));
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_v_bat(ADC1, &raw));
            TEST_ASSERT_TRUE(raw <= (0xFFFU * VBAT_DIVIDER_RATIO));
            LOGI(TAG, "[internal_channel_readings_complete_and_manage_their_own_enables] Raw V_bat sample: %u", raw);
            // VBATE must be switched back off once the reading is done
            TEST_ASSERT_FALSE(ADC->CCR & ADC_CCR_VBATE);

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_temperature(nullptr, &raw));
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_temperature(ADC1, &raw));
            TEST_ASSERT_TRUE(raw <= 0xFFFU);
            LOGI(TAG, "[internal_channel_readings_complete_and_manage_their_own_enables] Raw temperature sensor sample: %u", raw);
            // The temperature sensor/VREFINT stay latched on afterwards as they share the TSVREFE bit
            TEST_ASSERT_TRUE(ADC->CCR & ADC_CCR_TSVREFE);

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_v_ref_internal(nullptr, &raw));
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_v_ref_internal(ADC1, &raw));
            TEST_ASSERT_TRUE(raw <= 0xFFFU);
            LOGI(TAG, "[internal_channel_readings_complete_and_manage_their_own_enables] Raw V_ref_int sample: %u", raw);

            adc_power_on_temp_sensor(false);
        }

        void voltage_and_temperature_math_are_internally_consistent() {
            reset_to_baseline();

            float vdda = 0.0F;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_vdda(nullptr, &vdda));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_vdda(ADC1, nullptr));
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_vdda(ADC1, &vdda));
            // VDDA on this board is a regulated supply. Sanity bound it rather than assert an exact value
            TEST_ASSERT_TRUE(vdda > 3.0F && vdda < 3.5F);
            LOGI(TAG, "[voltage_and_temperature_math_are_internally_consistent] Vdda: %.3fV", (double)vdda);

            float temp_c = 0.0F;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_temp_celsius(nullptr, &temp_c));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_temp_celsius(ADC1, nullptr));
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_temp_celsius(ADC1, &temp_c));
            // Plausible temperature bound for a test runner. Not a calibrated accuracy check
            TEST_ASSERT_TRUE(temp_c > 25.0F && temp_c < 35.0F);
            LOGI(TAG, "[voltage_and_temperature_math_are_internally_consistent] Temperature: %.3fC", (double)temp_c);
        }

        void value_right_aligned_rejects_unknown_resolution() {
            reset_to_baseline();

            float          voltage          = 0.0F;
            constexpr auto bogus_resolution = static_cast<adc_resolution_t>(0xFF);
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_value_right_aligned(ADC1, 20, bogus_resolution, &voltage));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_value_right_aligned(ADC1, 20, ADC_RES_12_BITS, nullptr));
        }

        void regular_group_channel_sequence_registers_are_placed_correctly() {
            reset_to_baseline();

            // Exercises the SQR3/SQR2 boundary at 6/7 channels, the SQR2/SQR1 boundary at
            // 12/13 channels, and both extremes (1 and the maximum of 16)
            for (const auto count : {1U, 6U, 7U, 12U, 13U, MAX_REGULAR_CHANNELS}) {
                std::array<adc_channel_t, MAX_REGULAR_CHANNELS> sequence{};
                for (size_t i = 0; i < count; i++) {
                    sequence[i] = static_cast<adc_channel_t>(i);
                }

                std::array<uint16_t, MAX_REGULAR_CHANNELS> buffer{};
                const adc_continuous_config_t              config = {
                    .channels         = {.sequence = sequence.data(), .num_of_channels = count},
                    .trigger          = ADC_RG_TRIGGER_SOFTWARE,
                    .trigger_polarity = ADC_POLARITY_NONE,
                    .buffer_0         = buffer.data(),
                    .buffer_1         = nullptr,
                    .buffer_size      = static_cast<uint16_t>(count),
                    .priority         = DMA_PRIORITY_LOW,
                    // Circular mode is used here so the conversion doesn't terminate when the buffer is filled up
                    .circular_mode = DMA_MODE_CIRCULAR,
                    .callbacks     = {},
                };

                TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_start_conv(ADC1, &config));

                constexpr uint32_t BIT_WIDTH = 5;
                constexpr uint32_t MASK      = (1U << BIT_WIDTH) - 1U;

                for (size_t i = 0; i < count; i++) {
                    const uint32_t expected = std::to_underlying(sequence[i]) & MASK;
                    uint32_t       actual   = 0;
                    if (i >= 12) {
                        actual = (ADC1->SQR1 >> ((i - 12) * BIT_WIDTH)) & MASK;
                    } else if (i >= 6) {
                        actual = (ADC1->SQR2 >> ((i - 6) * BIT_WIDTH)) & MASK;
                    } else {
                        actual = (ADC1->SQR3 >> (i * BIT_WIDTH)) & MASK;
                    }
                    TEST_ASSERT_EQUAL_UINT32(expected, actual);
                }

                TEST_ASSERT_EQUAL_UINT32(count - 1, (ADC1->SQR1 & ADC_SQR1_L) >> ADC_SQR1_L_Pos);
                TEST_ASSERT_EQUAL(count > 1, static_cast<bool>(ADC1->CR1 & ADC_CR1_SCAN));

                TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_end_conv(ADC1));
            }

            reset_to_baseline();
        }

        void continuous_conversion_arg_guards() {
            reset_to_baseline();

            constexpr adc_channel_t channel = ADC_CHANNEL_0;
            std::array<uint16_t, 4> buffer  = {};

