engineer-ae3o/stm32-hal-library/components/test/src/adc.cpp
            auto too_many                     = config;
            too_many.channels.num_of_channels = MAX_INJECTED_CHANNELS + 1;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_start_conv(ADC1, &too_many));

            uint16_t result = 0;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_get_result(ADC1, nullptr, 1));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_get_result(ADC1, &result, 0));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_get_result(ADC1, &result, MAX_INJECTED_CHANNELS + 1));
        }

        void injected_group_invokes_the_completion_callback_via_the_isr() {
            reset_to_baseline();

            constexpr adc_channel_t     channels = ADC_CHANNEL_0;
            adc_injected_group_config_t config{};
            config.channels         = {.sequence = &channels, .num_of_channels = 1};
            config.trigger          = ADC_JG_TRIGGER_SOFTWARE;
            config.trigger_polarity = ADC_POLARITY_NONE;
            config.on_conv_complete = injected_done_cb;
            config.arg              = nullptr;

            s_injected_done = false;
            adc_enable_nvic_irq(true);

            TEST_ASSERT_EQUAL(HAL_OK, adc_injected_group_start_conv(ADC1, &config));
            TEST_ASSERT_TRUE_MESSAGE(wait_until([]() {
                                         return s_injected_done;
                                     }),
                                     "Injected group completion callback never fired");

            // Only the JEOCIE bit should have been cleared
            TEST_ASSERT_TRUE(ADC1->SR & ADC_SR_JEOC);
            TEST_ASSERT_FALSE(ADC1->CR1 & ADC_CR1_JEOCIE);

            std::array<uint16_t, MAX_INJECTED_CHANNELS> result{};
            TEST_ASSERT_EQUAL(HAL_OK, adc_injected_group_get_result(ADC1, result.data(), 1));

            // The JEOC flag should be cleared now by reading the result
            TEST_ASSERT_FALSE(ADC1->SR & ADC_SR_JEOC);

            adc_enable_nvic_irq(false);
            reset_to_baseline();
        }

        void injected_group_interrupts_regular_group_without_corruption() {
            // ...
        }

        void regular_group_runs_in_circular_and_double_buffering_mode() {
            reset_to_baseline();
            adc_enable_nvic_irq(true);

            constexpr auto CHANNELS = std::array{ADC_CHANNEL_0, ADC_CHANNEL_1, ADC_CHANNEL_2};
            for (const auto channel : CHANNELS) {
                adc_configure_channel(channel);
            }

            // Double buffering mode
            // Big enough buffers so it takes a bit of time to get filled up
            std::array<uint16_t, CHANNELS.size() * 4096> buffer_0{};
            std::array<uint16_t, buffer_0.size()>        buffer_1{};

            buffer_0.fill(UINT16_MAX);
            buffer_1.fill(UINT16_MAX);

            const adc_continuous_config_t config = {
                .channels         = {.sequence = CHANNELS.data(), .num_of_channels = CHANNELS.size()},
                .trigger          = ADC_RG_TRIGGER_SOFTWARE,
                .trigger_polarity = ADC_POLARITY_NONE,
                .buffer_0         = buffer_0.data(),
                .buffer_1         = buffer_1.data(),
                .buffer_size      = buffer_0.size(),
                .priority         = DMA_PRIORITY_LOW,
                .circular_mode    = DMA_MODE_DOUBLE_BUFFERS,
                .callbacks =
                    {
                        .on_buffer_full       = cont_done_cb,
                        .on_transfer_error    = nullptr,
                        .on_direct_mode_error = nullptr,
                        .on_data_overrun      = nullptr,
                        .user                 = nullptr,
                    },
            };

            TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_start_conv(ADC1, &config));

            // Let the buffers get filled a good number of times
            for (size_t i = 0; i < 20; i++) {
                // Wait for the first buffer (buffer_0) to be filled
                s_cont_done = false;
                TEST_ASSERT_TRUE_MESSAGE(wait_until([]() {
                                             return s_cont_done;
                                         }),
                                         "Continuous DMA conversion: buffer 0 never filled");
                TEST_ASSERT_EQUAL(0, s_filled_buffer_idx);

                // Wait for the second buffer (buffer_1) to be filled
                s_cont_done = false;
                TEST_ASSERT_TRUE_MESSAGE(wait_until([]() {
                                             return s_cont_done;
                                         }),
                                         "Continuous DMA conversion: buffer 1 never filled");
                TEST_ASSERT_EQUAL(1, s_filled_buffer_idx);
            }

            TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_end_conv(ADC1));

            for (const auto sample : buffer_0) {
                TEST_ASSERT_TRUE(sample <= 0xFFFU);
            }
            for (const auto sample : buffer_1) {
                TEST_ASSERT_TRUE(sample <= 0xFFFU);
            }

            // Pure circular mode (buffer_0 acts as a ring buffer)
            auto circ_config          = config;
            circ_config.circular_mode = DMA_MODE_CIRCULAR;
            circ_config.buffer_1      = nullptr;

            buffer_0.fill(UINT16_MAX);
            TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_start_conv(ADC1, &circ_config));

            for (size_t i = 0; i < 20; i++) {
                s_cont_done = false;
                TEST_ASSERT_TRUE_MESSAGE(wait_until([]() {
                                             return s_cont_done;
                                         }),
                                         "Continuous DMA conversion: buffer 0 never filled");

                // s_filled_buffer_idx contains garbage when not in double buffer mode, but that value should be constant
                static const uint8_t filled_buffer_idx = s_filled_buffer_idx;
                TEST_ASSERT_EQUAL_UINT8(filled_buffer_idx, s_filled_buffer_idx);
            }

            TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_end_conv(ADC1));

