engineer-ae3o/stm32-hal-library/components/test/src/adc.cpp
            for (const auto sample : buffer_0) {
                TEST_ASSERT_TRUE(sample <= 0xFFFU);
            }

            adc_enable_nvic_irq(false);
            reset_to_baseline();
        }

        void external_trigger_source_works_for_regular_and_injected_groups() {
            reset_to_baseline();
            adc_enable_nvic_irq(true);

            constexpr auto CHANNELS = std::array{ADC_CHANNEL_0, ADC_CHANNEL_1, ADC_CHANNEL_2};
            for (const auto channel : CHANNELS) {
                adc_configure_channel(channel);
            }

            std::array<uint16_t, CHANNELS.size() * 1024> buffer_0{};
            buffer_0.fill(UINT16_MAX);

            // The regular group
            const adc_continuous_config_t config = {
                .channels         = {.sequence = CHANNELS.data(), .num_of_channels = CHANNELS.size()},
                .trigger          = ADC_RG_TRIGGER_EXTI_LINE_11,
                .trigger_polarity = ADC_POLARITY_FALLING_EDGE,
                .buffer_0         = buffer_0.data(),
                .buffer_1         = nullptr,
                .buffer_size      = buffer_0.size(),
                .priority         = DMA_PRIORITY_LOW,
                .circular_mode    = DMA_MODE_CIRCULAR,
                .callbacks =
                    {
                        .on_buffer_full       = cont_done_cb,
                        .on_transfer_error    = nullptr,
                        .on_direct_mode_error = nullptr,
                        .on_data_overrun      = nullptr,
                        .user                 = nullptr,
                    },
            };
            TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_start_conv(ADC1, &config));
            TEST_ASSERT_EQUAL_UINT32(ADC_RG_TRIGGER_EXTI_LINE_11, ((ADC1->CR2 & ADC_CR2_EXTSEL) >> ADC_CR2_EXTSEL_Pos));
            TEST_ASSERT_EQUAL_UINT32(ADC_POLARITY_FALLING_EDGE, ((ADC1->CR2 & ADC_CR2_EXTEN) >> ADC_CR2_EXTEN_Pos));

            // Conversion should not be started yet. It waits for a falling edge on GPIO_PIN_11 on any port
            TEST_ASSERT_FALSE(ADC1->SR & ADC_SR_STRT);

            // Generate an EXTI request on EXTI line 11
            gpiox_clk_enable(GPIOA, true);
            gpio_set_output(GPIOA, GPIO_PIN_11);
            gpio_enable_pullups(GPIOA, GPIO_PIN_11, true);
            gpio_set_interrupt(GPIOA, GPIO_PIN_11, GPIO_FALLING_EDGE, nullptr, nullptr);

            // Get a falling edge on PA11 which is configured as EXTI line 11
            gpio_set_level(GPIOA, GPIO_PIN_11, true);
            gpio_set_level(GPIOA, GPIO_PIN_11, false);

            // The conversion should be started now, and everything should work as normal
            TEST_ASSERT_TRUE(ADC1->SR & ADC_SR_STRT);

            for (size_t i = 0; i < 20; i++) {
                s_cont_done = false;
                TEST_ASSERT_TRUE(wait_until([]() {
                    return s_cont_done;
                }));
            }

            TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_end_conv(ADC1));
            TEST_ASSERT_FALSE(ADC1->SR & ADC_SR_STRT);
            TEST_ASSERT_EQUAL_UINT32(0, ((ADC1->CR2 & ADC_CR2_EXTSEL) >> ADC_CR2_EXTSEL_Pos));
            TEST_ASSERT_EQUAL_UINT32(0, ((ADC1->CR2 & ADC_CR2_EXTEN) >> ADC_CR2_EXTEN_Pos));

            for (const auto sample : buffer_0) {
                TEST_ASSERT_TRUE(sample <= 0xFFFU);
            }

            // The injected group
            const adc_injected_group_config_t jg_config = {
                .channels         = {.sequence = CHANNELS.data(), .num_of_channels = CHANNELS.size()},
                .trigger          = ADC_JG_TRIGGER_EXTI_LINE_15,
                .trigger_polarity = ADC_POLARITY_FALLING_EDGE,
                .offsets          = {},
                .on_conv_complete = injected_done_cb,
                .arg              = nullptr,
            };
            TEST_ASSERT_EQUAL(HAL_OK, adc_injected_group_start_conv(ADC1, &jg_config));
            TEST_ASSERT_EQUAL_UINT32(ADC_JG_TRIGGER_EXTI_LINE_15, ((ADC1->CR2 & ADC_CR2_JEXTSEL) >> ADC_CR2_JEXTSEL_Pos));
            TEST_ASSERT_EQUAL_UINT32(ADC_POLARITY_FALLING_EDGE, ((ADC1->CR2 & ADC_CR2_JEXTEN) >> ADC_CR2_JEXTEN_Pos));

            // Conversion should not be started yet. It waits for a falling edge on GPIO_PIN_15 on any port
            TEST_ASSERT_FALSE(ADC1->SR & ADC_SR_JSTRT);
            s_injected_done = false;

            // Generate an EXTI request on EXTI line 15
            gpio_set_output(GPIOA, GPIO_PIN_15);
            gpio_enable_pullups(GPIOA, GPIO_PIN_15, true);
            gpio_set_interrupt(GPIOA, GPIO_PIN_15, GPIO_FALLING_EDGE, nullptr, nullptr);

            // Get a falling edge on PA15 which is configured as EXTI line 15
            gpio_set_level(GPIOA, GPIO_PIN_15, true);
            gpio_set_level(GPIOA, GPIO_PIN_15, false);

            // The conversion should be started now, and everything should work as normal
            TEST_ASSERT_TRUE(ADC1->SR & ADC_SR_JSTRT);

            TEST_ASSERT_TRUE(wait_until([]() {
                return s_injected_done;
            }));
            TEST_ASSERT_TRUE(ADC1->SR & ADC_SR_JEOC);

            std::array<uint16_t, CHANNELS.size()> jg_buffer{};
            jg_buffer.fill(UINT16_MAX);
            static_assert(jg_buffer.size() <= MAX_INJECTED_CHANNELS);

            TEST_ASSERT_EQUAL(HAL_OK, adc_injected_group_get_result(ADC1, jg_buffer.data(), jg_buffer.size()));
            TEST_ASSERT_FALSE(ADC1->SR & ADC_SR_JEOC);
            TEST_ASSERT_FALSE(ADC1->SR & ADC_SR_JSTRT);
            TEST_ASSERT_EQUAL_UINT32(0, ((ADC1->CR2 & ADC_CR2_JEXTSEL) >> ADC_CR2_JEXTSEL_Pos));
            TEST_ASSERT_EQUAL_UINT32(0, ((ADC1->CR2 & ADC_CR2_JEXTEN) >> ADC_CR2_JEXTEN_Pos));

            for (const auto sample : jg_buffer) {
                TEST_ASSERT_TRUE(sample <= 0xFFFU);
                LOGI(TAG, "Injected sample: %u", sample);
            }

            adc_enable_nvic_irq(false);
            reset_to_baseline();
        }

        void analog_watchdog_validates_thresholds_and_monitor_flags() {
            reset_to_baseline();
            adc_enable_nvic_irq(true);

