engineer-ae3o/stm32-hal-library/components/test/src/adc.cpp
            adc_analog_wdg_config_t config   = {};
            config.min_adc_value             = 100;
            config.max_adc_value             = 50; // Inverted on purpose
            config.on_thresholds_violated    = wdg_cb;
            config.monitor_regular_channels  = true;
            config.monitor_injected_channels = false;

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_start(ADC1, &config));

            config.min_adc_value = 50;
            config.max_adc_value = 100;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_start(nullptr, &config));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_start(ADC1, nullptr));

            auto no_callback                   = config;
            no_callback.on_thresholds_violated = nullptr;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_start(ADC1, &no_callback));

            auto no_monitor_target                      = config;
            no_monitor_target.monitor_regular_channels  = false;
            no_monitor_target.monitor_injected_channels = false;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_start(ADC1, &no_monitor_target));

            struct combo_t {
                bool     regular;
                bool     injected;
                uint32_t expected_bits;
            };
            constexpr std::array<combo_t, 3> COMBOS = {{
                {.regular = true, .injected = true, .expected_bits = ADC_CR1_AWDEN | ADC_CR1_JAWDEN},
                {.regular = false, .injected = true, .expected_bits = ADC_CR1_JAWDEN},
                {.regular = true, .injected = false, .expected_bits = ADC_CR1_AWDEN},
            }};

            for (const auto& combo : COMBOS) {
                auto cfg                      = config;
                cfg.monitor_regular_channels  = combo.regular;
                cfg.monitor_injected_channels = combo.injected;
                cfg.min_adc_value             = 0x1234; // Deliberately > 12 bits to verify masking. Should be masked to 0x234
                cfg.max_adc_value             = 0xFFFF; // Should be masked to 0xFFF

                TEST_ASSERT_EQUAL(HAL_OK, adc_analog_wdg_start(ADC1, &cfg));
                TEST_ASSERT_EQUAL_UINT32(combo.expected_bits, ADC1->CR1 & (ADC_CR1_AWDEN | ADC_CR1_JAWDEN));
                TEST_ASSERT_TRUE(ADC1->CR1 & ADC_CR1_AWDIE);
                TEST_ASSERT_EQUAL_UINT32(cfg.max_adc_value & 0xFFFU, ADC1->HTR);
                TEST_ASSERT_EQUAL_UINT32(cfg.min_adc_value & 0xFFFU, ADC1->LTR);

                TEST_ASSERT_EQUAL(HAL_OK, adc_analog_wdg_stop(ADC1));
                TEST_ASSERT_EQUAL_UINT32(0, ADC1->CR1 & (ADC_CR1_AWDEN | ADC_CR1_JAWDEN | ADC_CR1_AWDIE));
            }

            // Test to see if the watchdog fires the callback
            config.max_adc_value             = 1; // Deliberately low so the watchdog fires
            config.min_adc_value             = 0;
            config.on_thresholds_violated    = wdg_cb;
            config.monitor_regular_channels  = true;
            config.monitor_injected_channels = true;

            s_wdg_triggered = false;

            TEST_ASSERT_EQUAL(HAL_OK, adc_analog_wdg_start(ADC1, &config));

            // Start conversion on any channel
            constexpr adc_channel_t channel = ADC_CHANNEL_0;
            uint16_t                raw     = 0;
            TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_get_oneshot(ADC1, channel, &raw));

            TEST_ASSERT_TRUE_MESSAGE(wait_until([]() {
                                         return s_wdg_triggered;
                                     }),
                                     "Analog watchdog never fires");

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_stop(nullptr));
            TEST_ASSERT_EQUAL(HAL_OK, adc_analog_wdg_stop(ADC1));

            adc_enable_nvic_irq(false);
            reset_to_baseline();
        }

    } // namespace

    void all() {
        LOGI(TAG, "Starting the tests on the ADC driver");
        UNITY_BEGIN();

        RUN_TEST(clk_enable_rejects_unknown_handles);
        RUN_TEST(power_on_toggles_adon);
        RUN_TEST(configure_covers_every_alignment_resolution_and_sample_time);
        RUN_TEST(deconfigure_powers_down_and_clears_state);
        RUN_TEST(clk_configure_sweeps_every_prescaler);
        RUN_TEST(nvic_irq_enable_toggles_the_adc_line);
        RUN_TEST(temp_sensor_power_toggles_tsvrefe);
        RUN_TEST(oneshot_regular_group_completes_within_12_bit_range);
        RUN_TEST(internal_channel_readings_complete_and_manage_their_own_enables);
        RUN_TEST(voltage_and_temperature_math_are_internally_consistent);
        RUN_TEST(value_right_aligned_rejects_unknown_resolution);
        RUN_TEST(regular_group_channel_sequence_registers_are_placed_correctly);
        RUN_TEST(continuous_conversion_arg_guards);
        RUN_TEST(continuous_conversion_fills_the_buffer_via_dma_and_calls_back);
        RUN_TEST(injected_group_covers_every_channel_count_and_offset_slot);
        RUN_TEST(injected_group_result_before_completion_is_not_done);
        RUN_TEST(injected_group_arg_guards);
        RUN_TEST(injected_group_invokes_the_completion_callback_via_the_isr);
        RUN_TEST(injected_group_interrupts_regular_group_without_corruption);
        RUN_TEST(regular_group_runs_in_circular_and_double_buffering_mode);
        RUN_TEST(external_trigger_source_works_for_regular_and_injected_groups);
        RUN_TEST(analog_watchdog_validates_thresholds_and_monitor_flags);

        UNITY_END();
        LOGI(TAG, "Done with all tests on the ADC driver");
    }

} // namespace test::adc
